In [1]:
import pandas as pd
import numpy as np
import scipy.stats as stats

In [2]:
data=pd.read_csv("Testing_Of_Hypothesis.csv")
data.head()

   Sr No S_Cust_id  Samsung Score Apple_Cust_id  Apple_Score
0      1   S336499             94       A336525           82
1      2    S73004             99        A73011           83
2      3    S79537             74        A79538           88
3      4   S769168             74       A769222           80
4      5   S609791             83       A609801           74

In [3]:
samsung_data=data.loc[:,["S_Cust_id","Samsung Score"]]
samsung_data=samsung_data.rename(columns={"Samsung Score":"Samsung_Score"})
samsung_data.head()

  S_Cust_id  Samsung_Score
0   S336499             94
1    S73004             99
2    S79537             74
3   S769168             74
4   S609791             83

In [4]:
apple_data=data.loc[:,["Apple_Cust_id","Apple_Score"]]
apple_data.head()

  Apple_Cust_id  Apple_Score
0       A336525           82
1        A73011           83
2        A79538           88
3       A769222           80
4       A609801           74

In [ ]:
# Solution 1
#Parameters taken into consideration is Satisfaction score of samsung(samsung_data.Samsung_Score) and 75(Hypotheised value)

Hypothesis Testing Steps:

step-1: Identify the problem:- Is Samsung Average customer satisfaction score minimum 75%?

step-2: Describe the hypothesis:-
        Ho: samsung customer satisfaction score == 75
        H1: samsung customer satisfaction score > 75
        
step-3: Statistical Test: 1 sample t test because we are comparing one continous variables with hypotheised value.

In [5]:
stats.ttest_1samp(a=samsung_data.Samsung_Score,popmean=75)

Ttest_1sampResult(statistic=8.358287450922418, pvalue=4.0739777034636007e-13)

Step-4: Statistical Score: T value

Step-5: Decide:- As pvalue(4.0739777034636007e-13)<0.05 which implies we reject null hypothesis so accept alt hypothesis.

So, Samsung Average customer satisfaction score is minimum 75%.

In [ ]:
# Solution 2
# Parameters taken into consideration are samsung satisfaction score(samsung_data.Samsung_Score) and 
# apple satisfation score(apple_data.Apple_Score)

Hypothesis Testing Steps:

step-1: Indetify the problem:- Is overall average satisfaction score of Samsung is same as Apple. There is no significant difference in the satisfaction scores?

step-2: Describe the hypothesis:
        Ho: samsung customer satisfaction score == apple customer satisfaction score
        Ha: samsung customer satisfaction score <> apple customer satisfaction score
        
step-3: Statistical Test: 2 sample t test because we are comparing two continous variables.

In [11]:
stats.ttest_rel(a=samsung_data.Samsung_Score,b=apple_data.Apple_Score)

Ttest_relResult(statistic=-1.9015800946572132, pvalue=0.06013359092250471)

Step-4: Statistical Score: T value

Step-5: Decide:- As pvalue(0.06)>0.05 which implies we fail to reject null hypothesis so accept null hypothesis.

So, The overall average satisfaction score of Samsung is same as Apple.